#include<stdio.h>
#include<windows.h>
/*1. 
5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果 
A选手说：B第二，我第三； b=2,a=3
B选手说：我第二，E第四； b=2,e=4
C选手说：我第一，D第二； c=1,d=2
D选手说：C最后，我第三； c=5,d=1
E选手说：我第四，A第一； e=4,a=1
比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。 */
//信息数字化，然后设计五层循环，保证五个人名词不会有重复，也就是名次不能有并列的
//每人说的话一半真一半机啊可以总结为(（b==2）+(a==3)==1)
void range(){
	int a, b, c, d, e;
	for (a = 1; a <= 5; a++){
		for (b = 1; b <= 5; b++){
			if (a != b){
				for (c = 1; c <= 5; c++){
					if (c != a&&c != b){
						for (d = 1; d <= 5; d++){
							if (d != a&&d != b&&d != c){
								for (e = 1; e <= 5; e++){
									if (e != a&&e != b&&e != c&&e != d){
										if (((b == 2) + (a == 3))==1 && ((b == 2) + (e == 4)) ==1&& ((c == 1) + (d == 2))==1 && \
											((c == 5) + (d == 1))==1&& ((e == 4) + (a == 1))==1){
											printf("a=%d b=%d c=%d d=%d e=%d\n", a,b,c,d,e);
											
											
										}
									}
								}
							}
						}
					}
				}
			}
		}
	}
}
/*日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个 
嫌疑犯的一个。以下为4个嫌疑犯的供词。 
A说：不是我。 x!=1
B说：是C。 x==3
C说：是D。 x==4
D说：C在胡说 x!=4
已知3个人说了真话，1个人说的是假话。 
现在请根据这些信息，写一个程序来确定到底谁是凶手。 */
//设abcd四个人分别为1，2，3，4，小偷为x
void thief(){
	int x;
	for (x = 1; x <= 4; x++){
		if ((x != 1) + (x == 3) + (x == 4) + (x != 4) == 3){
			printf("x=%d", x);
		}
	}
}
/*3.在屏幕上打印杨辉三角。 */
/*
			1
		  1   1
	   1    2    1
	 1   3    3    1
   1   4   6    4   1
 1   5  10   10   5   1
 1   6  15   20  15   6   1
*/
void Triangle(int n){//行数
	int i, j, a[100];
	printf("  1\n");//第一行一个1
	a[1] = a[2] = 1;//第二行两个1
	printf("%3d %3d\n", a[1], a[2]);
	for (i = 3; i <= n; i++ ){//这个循环走一遍完成一行，i标识行
		a[1] = a[i] = 1;//每行第一个都是1，最后一个也是1
		for (j = i - 1; j > 1; j--){//j标识每一行的第j个数
			a[j] = a[j] + a[j - 1];//当前行第j个数等于上一行第j个数加第j-1个数
		}
		for (j = 1; j <= i; j++){
			printf("%3d ", a[j]);
		}
		printf("\n");
	}

}
void y_Triangle(int n){
	int a[100];//1   1  2 1
	int b[100];//1 1   1 3 3 1
	a[0] = 1;

}
int main(){

	//range();
	/*thief();
	printf("\n");
	*/
	Triangle(10);
	system("pause");
	
	return 0;
}